const booksData = {
    1: {
      id: 1,
      coverSrc: 'https://img3m8.ddimg.cn/76/16/29300908-1_u_6.jpg',
      title: '无声告白',
      price: '￥45.00',
      author: '伍绮诗',
      press: '江苏文艺出版社',
      pubTime: '2015-07-01',
      stocks: 100,
      description: '莉迪亚死了，可他们还不知道。'
            + '\n莉迪亚是家中老二，李先生和李太太的掌上明珠，她遗传了母亲的蓝眼睛和父亲的黑头发。'
            + '父母深信，莉迪亚一定能实现他们无法实现的梦想。莉迪亚的尸体被发现后，她的父亲内疚不已，母亲则一心报复。'
            + '莉迪亚的哥哥觉得，隔壁的坏小子铁定脱不了关系，只有莉迪亚的妹妹看得一清二楚，而且，很可能只有她知道真相……',
    },
    2: {
      id: 2,
      coverSrc: 'https://img3m2.ddimg.cn/4/34/1700322232-5_u_7.jpg',
      title: '绝叫',
      price: '￥58.00',
      author: '叶真中显',
      press: '北京联合出版公司',
      pubTime: '2020-07-01',
      stocks: 100,
      description: "铃木阳子死了，死在独居的公寓里。\n正确说来，是铃木阳子几个月前死了。因为发现她时，遗体不但遭到屋内的十一只猫啃食殆尽，连猫也全数饿死了。\n铃木阳子显然是“孤独死”的范例，但这名女子为何落到这步田地？她的亲人朋友同事在哪里？她的人生轨迹又是如何？",
    },
    3: {
      id: 3,
      coverSrc: 'https://img3m9.ddimg.cn/6/36/29279949-1_u_30.jpg',
      title: '这么多年（全三册）',
      price: '￥128.00',
      author: '八月长安',
      press: '江苏凤凰文艺出版社',
      pubTime: '2021-08-01',
      stocks: 100,
      description: '《这么多年》和《你好，旧时光》《好的我们》《暗恋·橘生淮南》一样，故事依然发生在振华高中。但这个故事和他们也都不一样。\n八月长安这次写的，是一个不一样的成长故事。\n成长是什么？成长会让陈见夏发现，这个广袤世界的天空、海洋和宇宙，无边无际，只有自己。\n然而，总会有一个人听见她的声音。\n她是浩渺宇宙中被遗弃的飞船，沉寂多年的对讲机里，他是应答。',
    },
    4: {
      id: 4,
      coverSrc: 'https://img3m5.ddimg.cn/51/27/1294548405-2_u_1690537746.jpg',
      title: 'Flipped',
      price: '￥35.00',
      author: 'Wendelin Van Draanen',
      press: 'Knopf Books for Young Readers',
      pubTime: '2001-01-01',
      stocks: 100,
      description: 'Flipped is a romance told in two voices. The first time Juli Baker saw Bryce Loski, she flipped. The first time Bryce saw Juli, he ran. That’s pretty much the pattern for these two neighbors until the eighth grade, when, just as Juli is realizing Bryce isn’t as wonderful as she thought, Bryce is starting to see that Juli is pretty amazing. How these two teens manage to see beyond the surface of things and come together makes for a comic and poignant romance.',
    },
    5: {
      id: 5,
      coverSrc: 'http://t15.baidu.com/it/u=1859731211,1344113497&fm=224&app=112&f=JPEG?w=500&h=500',
      title: '吉祥寺的朝日奈',
      price: '￥56.30',
      author: '中田永一',
      press: '台海出版社',
      pubTime: '2022-04-01',
      stocks: 100,
      description: '《开始交换日记了！》圭太和遥用交换日记的方式传达对彼此的关心。然而，本应专属二人的笔记本却出现了其他人的笔迹……'
              + '\n《涂鸦大冒险》作为轰动一时的校园涂鸦事件参与者，我试图联系昔日的“同伙”。可时隔五年，竟没有一个人记得他……'
              + '\n《先别破坏三角形》雨水绵密的傍晚，我要好的朋友邂逅了她。朋友对她一见钟情，而我也有着自己的小心思……'
              + '\n《吵闹的肚子》我的肚子总是发出奇怪的声响，为此我苦恼不已。我想方设法遮掩这令人蒙羞的声音时，却发现同班同学春日井天生听觉敏锐，我的小伎俩在他面前无所遁形。有一天，春日井竟然跟我说……'
              + '\n《吉祥寺的朝日奈》梦想破碎的我对山田小姐抱有莫名的爱恋，但她的无名指上有一枚令人无法忽视的戒指……这是发生在吉祥寺、围绕我与山田小姐间永恒之爱的故事。',
    },
    6: {
      id: 6,
      coverSrc: 'https://img3m5.ddimg.cn/73/29/24162805-1_u_7.jpg',
      title: '山之四季',
      price: '￥32.00',
      author: '高村光太郎',
      press: '云南人民出版社',
      pubTime: '2017-01-01',
      stocks: 100,
      description: '日本生活美学家松浦弥太郎推崇的诗人！首次译介到中文世界！！'
                + '\n《山之四季》是松浦弥太郎在《日日100》中严选推荐的好书！真正的百里挑一！！'
                + '\n“《山之四季》这本随笔集，记述了高村光太郎的山居生活，优美的文字像是在对孩子娓娓诉说。”'
                + '\n“我很喜欢*篇《山之雪》，一次又一次地抄写、朗读。我梦想能在雪夜的山庄住一晚，哪怕一次也好，一边读着高村光太郎的《山之雪》。”——松浦弥太郎《日日100：一百件私人珍爱》'
                + '\n日本近代桂冠诗人高村光太郎山居笔记，15篇文字记录山中隐居生活。'
                + '\n春夏秋冬的四季变换、人与自然的交织交融、新知故人的相知相爱。纯真、质朴、清新。'
                + '\n根据日本中央公论社昭和三十一年（1956）版《山之四季》完整译出，译者毕业于北京大学日语系，译笔精良。',
    },
    7: {
      id: 7,
      coverSrc: 'https://img3m3.ddimg.cn/38/0/11429013953-1_u_1.jpg',
      title: '非理性的人',
      price: '￥45.00',
      author: '威廉·巴雷特',
      press: '上海译文出版社',
      pubTime: '2011-12-01',
      stocks: 100,
      description: '《非理性的人》是威廉·巴雷特的成名作和代表作，被公认为英语国家中研究、解释和介绍存在主义的很优秀的著作，在美国和整个西方哲学界享有很高的声誉。它在问世后多次再版，畅销不衰，至今仍被一些大学列为“当代哲学”和“存在主义哲学”课程的教科书。',
    },
    8: {
      id: 8,
      coverSrc: 'https://img3m1.ddimg.cn/73/10/29552761-1_u_2.jpg',
      title: '跃动青春1',
      price: '￥32.00',
      author: '高松美咲',
      press: '湖南文艺出版社',
      pubTime: '2023-03-01',
      stocks: 100,
      description: '高一的春天，从偏远的乡下来到东京的重点学校！\n岩仓美津未的人生规划虽然很完美，神经却有点大条，\n不知不觉就打动了周围的人，刮起了一场天然呆的“幸福旋风”！',
    },
    9: {
      id: 9,
      coverSrc: 'https://img3m6.ddimg.cn/78/15/29552766-1_u_2.jpg',
      title: '跃动青春2',
      price: '￥32.00',
      author: '高松美咲',
      press: '湖南文艺出版社',
      pubTime: '2023-03-01',
      stocks: 100,
      description: '在东京的高中生活迎来个夏天！\n“天然呆”·“幸福旋风”·美津未与宝贵的朋友们的高中生活，\n虽然偶尔会出现“不和谐”的音符，\n但大家不知不觉都变得Joyful起来了！',
    },
    10: {
      id: 10,
      coverSrc: 'https://img3m5.ddimg.cn/77/14/29552765-1_u_2.jpg',
      title: '跃动青春3',
      price: '￥32.00',
      author: '高松美咲',
      press: '湖南文艺出版社',
      pubTime: '2023-03-01',
      stocks: 100,
      description: '只要跟《跃动青春》在一起，每天都有新的奇遇。\n在东京的高中生活迎来个冬季。\n人们都暗自期盼着情人节的到来，又在白色情人节内心小鹿乱撞。\n“天然呆”·“幸福旋风”·美津未的高一生活马上就要走向新的学年了！',
    },
    11: {
      id: 11,
      coverSrc: 'https://img3m2.ddimg.cn/74/11/29552762-1_u_2.jpg',
      title: '跃动青春4',
      price: '￥32.00',
      author: '高松美咲',
      press: '湖南文艺出版社',
      pubTime: '2023-03-01',
      stocks: 100,
      description: '在东京的高中生活迎来个文化祭！\n“天然呆”·“幸福旋风”·美津未与宝贵的朋友们的重大活动。\n虽然偶尔会出现“不和谐”的音符，\n但大家不知不觉都变得Positive起来了！',
    },
    12: {
      id: 12,
      coverSrc: 'https://img3m3.ddimg.cn/75/12/29552763-1_u_2.jpg',
      title: '跃动青春5',
      price: '￥32.00',
      author: '高松美咲',
      press: '湖南文艺出版社',
      pubTime: '2023-03-01',
      stocks: 100,
      description: '在东京的高中生活从秋季转向冬季。\n“天然呆”·“幸福旋风”·美津未与宝贵的朋友们的冬季庆典。\n虽然偶尔会出现“不和谐”的音符，\n但大家不知不觉都变得Miracle☆Happy起来了！',
    },
    13: {
      id: 13,
      coverSrc: 'https://img3m4.ddimg.cn/76/13/29552764-1_u_2.jpg',
      title: '跃动青春6',
      price: '￥32.00',
      author: '高松美咲',
      press: '湖南文艺出版社',
      pubTime: '2023-03-01',
      stocks: 100,
      description: '只要跟《跃动青春》在一起，每天都有新的奇遇。\n在东京的高中生活迎来个冬季。\n人们都暗自期盼着情人节的到来，又在白色情人节内心小鹿乱撞。\n“天然呆”·“幸福旋风”·美津未的高一生活马上就要走向新的学年了！',
    },
    14: {
      id: 14,
      coverSrc: 'https://img3m6.ddimg.cn/47/15/11566099856-1_u_1697788752.jpg',
      title: '长安的荔枝',
      price: '￥45.00',
      author: '马伯庸',
      press: '湖南文艺出版社',
      pubTime: '2022-10-31',
      stocks: 100,
      description: '大唐天宝十四年，长安城的小吏李善德突然接到一个任务：要在贵妃诞日之前，从岭南运来新鲜荔枝。荔枝“一日色变，两日香变，三日味变”，而岭南距长安五千余里，山水迢迢，这是个不可能完成的任务，可为了家人，李善德决心放手一搏：“就算失败，我也想知道，自己倒在距离终点多远的地方。”\n《长安的荔枝》是马伯庸备受好评的历史小说。\n唐朝诗人杜牧的一句“一骑红尘妃子笑，无人知是荔枝来”一千多年来引发了人们的无限遐想，但鲜荔枝的保鲜时限仅有三天，这场跨越五千余里的传奇转运之旅究竟是如何达成的，谁让杨贵妃在长安吃到了来自岭南的鲜荔枝？作者马伯庸就此展开了一场脑洞非常大的想象。\n沿袭马伯庸写作一贯以来的时空紧张感，不仅让读者看到了小人物的乱世生存之道，也感受到了事在人为的热血奋斗。随书附赠“荔枝鲜转运舆图”。',
    },
    15: {
      id: 15,
      coverSrc: 'https://img3m8.ddimg.cn/93/9/27854238-6_u_1691564899.jpg',
      title: '文化苦旅',
      price: '￥49.80',
      author: '余秋雨',
      press: '长江文艺出版社',
      pubTime: '2019-04-01',
      stocks: 100,
      description: '《文化苦旅》一书于1992年首次出版，是余秋雨先生在1989年起在海内外讲学和考察途中写下的作品，是他的文化散文集。全书主要包括两部分，一部分为历史、文化散文，另一部分为回忆散文。甫一面世，该书就以文采飞扬、知识丰厚、见解独到而深受万千读者喜爱。由此开创“历史大散文”一代文风，令世人重拾中华文化价值。他的散文别具一格，见常人所未见，思常人所未思，善于在美妙的文字中一步步将读者带入历史文化长河，启迪哲思，引发情致，具有很高的审美价值和史学、文化价值。书中多篇文章后入选中学教材。但由于此书的重大影响，在为余秋雨先生带来无数光环和拥趸的同时，也带来了数之不尽的麻烦和盗版。誉满天下，“谤”亦随身。余秋雨先生在身心俱疲之下，决定亲自修订、重编此书。\n《文化苦旅（修订本）》作为余秋雨先生30年历史文化散文修订自选集，新增文章18篇，其中入选教材的《道士塔》《莫高窟》《都江堰》等经典篇目全部经过改写、修订。新版内容与旧版相比，全新和改写的篇目达到三分之二以上，对新老读者都是一场全新的阅读体验和人文享受。堪称余秋雨30年来不懈的文化考察和人生思索的完美结晶。',
    },
  };
  
const getBookInfoById = (id) => {
    const book = booksData[id];
    if (book) {
      return book;
    } else {
      throw new Error(`Book with id ${id} not found.`);
    }
};
  
export default getBookInfoById;
  